//1)რა განსხვავება პრიმიტიულ და არაპრიმიტიულ მონაცემთა ტიპებში?
//answer: 

//პრიმიტიულ ტიპებს აქვთ მხოლოდ ერთი მნიშვნელობა მაგ: let numbers = 3
//არაპრიმიტიულს კი აქ მრავალი მნიშვნელობა მაგ: let numbers = [1,2,3,4,5,6,,7,8,9,10] 


//2)რა განსხვავება ცვლადებს const და let შორის და დაწერეთ პატარა მაგალითიც!!
//answer:


// let-შეგვიძლია სხვა მნიშვნელობა მივანჭოთ
//მაგალითად, თუ ვიტყვით, რომ 
let number = 10
console.log(number) // ანუ number არი 10 და console ში დაეწერება 10
//ხოლო თუ დავწერთ რომ...
number=15
console.log(number) //გადაეწერება და გახდება 15
// კონსტანტას კი მნიშვნელობა არ ეცვლება ხოლო თუ ვცდით შეცვლას გვექნება ერორი
 const numbers = 15
 console.log(numbers)  


//3)დაწერეთ კოდი, სადაც აღწერთ თითოეული პრიმიტიული
//მონაცემთა ტიპის ცვლადს სხვადასხვა მნიშვნელობებით და 
// შეუცვალეთ რამდენიმეს შემდგომ მნიშვნელობები ანუ 
//გადააწერეთ ახალი მნიშვნელობა და დალოგეთ შემდეგ ეს ცვლადები.
let firstname = 'zeko'
let age = 18
let address = 'tbilisi'
firstname = 'gigi'
console.log(firstname, age, address)

//4)აღწერეთ არაპრიმიტიული მონაცემთა ტიპები მაგალითად array
// და array-ში რომ გქონდეთ object და თქვენ შესახებ ინფორმაცია აღწერეთ ამ
// object-ში;მაგალითად let user = [{name: 'nika'}] და ასე
//შემდეგ ყველა ინფორმაციით შეავსეთ თქვენ შესახებ რომელიც შეიცავს
//(firstName,lastName,age,email,address,isStudent) და დალოგეთ

//არაი არის მასივი- მასიური მონაცემთა ტიპი,რომელშიც შეგვიძლია შევიყვანოთ ათასობით მმონაცემი
let myinfo = [ {  firstname, age, address}]
console.log( myinfo)